IDEA Open Model
OpenModel.GetMaxId Method (OpenElementId)
Compatible with IDEA StatiCa Beta 20.0
 Get max Id value for specified type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int GetMaxId(
	OpenElementId obj
)
Public Function GetMaxId (
	obj As OpenElementId
) As Integer
Parameters
obj
Type: IdeaRS.OpenModel.OpenElementId
Object
Return Value
Type: Int32
Max Id value or zero if don't any exists
See Also
Reference
OpenModel Class
GetMaxId Overload
IdeaRS.OpenModel Namespace